Revit 2026 API

# JoinGeometryUtilsAreElementsJoined Method

---

Determines whether two elements are joined.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreElementsJoined(
	Document document,
	Element firstElement,
	Element secondElement
)
```
```vb
Public Shared Function AreElementsJoined (
	document As Document,
	firstElement As Element,
	secondElement As Element
) As Boolean
```
```cpp
public:
static bool AreElementsJoined(
	Document^ document,
	Element^ firstElement,
	Element^ secondElement
)
```
```fsharp
static member AreElementsJoined :
        document : Document *
        firstElement : Element *
        secondElement : Element -> bool
```

#### Parameters

document Document
     The document containing the two elements.
firstElement Element
     The first element.
secondElement Element
     The second element.

#### Return Value

Boolean True if the two elements are joined.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. -or- The element firstElement was not found in the given document. -or- The element secondElement was not found in the given document. |
| ArgumentNullException | A non-optional argument was null |

This functionality is not available for family documents.

#### Reference

JoinGeometryUtils Class

Autodesk.Revit.DB Namespace